List<Map<String, int>> titles = [
  {'الْقَصِيدَة الأُولَى : التّائِيَّة': 9},
  {'الْقَصِيدَة الثّانِيَة : النُّونِيَّة': 34},
  {'الْقَصِيدَة الثّالِثَة : الْمَهْدِيَّة': 38},
  {'الْقَصِيدَة الرّابِعَة : البائيَّة': 36},
  {'الْقَصِيدَة الْخَامِسَة : الزّادِيَّة': 38},
  {'الْقَصِيدَة السّادِسَة : الْهَمْزِيَّة': 39},
  {'الْقَصِيدَة السّابِعَة : الوَصِيَّة': 41},
  {'الْقَصِيدَة الثّامِنَة : الأَحَدِيَّة': 47},
  {'الْقَصِيدَة التّاسِعَة : الْهَائِيَّة': 48},
  {'الْقَصِيدَة الْعَاشِرَة : الكافِيَّة': 49},
];